Repository: Xcube-Studio/Natsurainko.FluentLauncher
Catalog: Fluent Launcher/FluentLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AboutPage_Author.Text
source: Author
zh_cn: 作者

# AboutPage_Author_Content.Text
source: (Application,LaunchCore)
zh_cn: (应用程序,启动核心)

# AboutPage_Copyright.Text
source: Copyright
zh_cn: 版权

# AboutPage_Dependencies.Text
source: Dependencies
zh_cn: 依赖

# AboutPage_Edition.Text
source: Preview Edition
zh_cn: 预览版本

# AboutPage_HyperlinkButton.Content
source: Show More
zh_cn: 显示更多

# AboutPage_Sources.Text
source: Sources
zh_cn: 开源

# AboutPage_Statement.Text
source: Statement
zh_cn: 声明

# AboutPage_Statement_Content.Text
source: Minecraft is copyrighted by Mojang Studios. We are not responsible for any copyright infringement arising from use of this software.
zh_cn: Minecraft 版权归 Mojang Studios 所有。 开发者对因使用本软件而引起的任何版权侵权不承担任何责任。

# AboutPage_ThanksTo.Text
source: Thanks To
zh_cn: 鸣谢

# AboutPage_WebService.Text
source: WebService
zh_cn: 网络服务

# AccountPage_1_Annotate1.Text
source: The character name in the game will depend on your account
zh_cn: 游戏中的角色名字将会取决于你的账户

# AccountPage_1_Annotate2.Text
source: Some of the servers might not allow offline accounts to login.
zh_cn: 某些服务器可能不支持离线账户进入

# AccountPage_AccountDataTemplate_Refresh.Text
source: Refresh
zh_cn: 刷新

# AccountPage_AccountsListViewItem_SubTitle.Text
source: Click To Add
zh_cn: 点击以添加

# AccountPage_AccountsListViewItem_Title.Text
source: Add New Account
zh_cn: 添加一个新账户

# AccountPage_AddAccountDialog_AccountTypeBox.PlaceholderText
source: type
zh_cn: 类型

# AccountPage_AddAccountDialog_AccountTypeBox_Header.Text
source: Account Type
zh_cn: 账户类型

# AccountPage_AddAccountDialog_Buy.Text
source: Purchase Minecraft
zh_cn: 购买 Minecraft

# AccountPage_AddAccountDialog_DisplayNameBox.PlaceholderText
source: display name
zh_cn: 名称

# AccountPage_AddAccountDialog_DisplayNameBox_Header.Text
source: Display Name
zh_cn: 游戏名称

# AccountPage_AddAccountDialog_Info_Content.Text
source: You Should Click "Login" Button and Continue Login Process in the Opened WebBrowser
zh_cn: 你应该点击 "登录" 按钮，然后完成接下来的登录步骤在弹出的浏览器中

# AccountPage_AddAccountDialog_Info_Title.Text
source: Info
zh_cn: 提示

# AccountPage_AddAccountDialog_LoginButton_Content.Text
source: Login
zh_cn: 登录

# AccountPage_AddAccountDialog_Title.Text
source: Add New Account
zh_cn: 添加新的账户

# AccountPage_SubTitle.Text
source: Accounts
zh_cn: 账户

# AccountPage_Title.Text
source: Account Settings
zh_cn: 账户设置

# BasicSettingPage_1_Annotate1.Text
source: All the cores in the list come from the folder of your choice
zh_cn: 所有的游戏核心都来源于你选择的目录

# BasicSettingPage_1_Annotate2.Text
source: When you add a new version, it will be installed in this folder
zh_cn: 当你安装一个新的版本时，它将会被安装在你选择的目录

# BasicSettingPage_2_Annotate1.Text
source: Current Java Environment Info
zh_cn: 当前 Java 运行时信息

# BasicSettingPage_2_Annotate2.Text
source: You need at least one to launcher your game
zh_cn: 你至少需要一个 Java 运行时来启动游戏

# BasicSettingPage_2_Annotate3.Text
source: Please choose the most suitable environment for your computer
zh_cn: 高版本（如1.17）需要 Java16 版本以上的运行时，所以请选择最合适的 Java 运行时来启动游戏

# BasicSettingPage_3_Annotate1.Text
source: Too little memory can cause fps to be low
zh_cn: 过小的内存可能会导致游戏帧数低

# BasicSettingPage_3_Annotate2.Text
source: 32 bit Java can only set 1024Mb of memory at most
zh_cn: 32位 Java 运行时最多只能加载1GB内存

# BasicSettingPage_4_Annotate1.Text
source: The game will run in the folder of your choice
zh_cn: 游戏的运行目录将会以选定的模式执行

# BasicSettingPage_5_Annotate1.Text
source: The language will change when you open launcher next time
zh_cn: 语言将在你下一次打开启动器时生效

# BasicSettingPage_AddFolderDialog_AddFolderNameBox.PlaceholderText
source: name
zh_cn: 名称

# BasicSettingPage_AddFolderDialog_AddFolderNameBox_Header.Text
source: Folder Name
zh_cn: 文件夹昵称

# BasicSettingPage_AddFolderDialog_AddFolderPathBox.PlaceholderText
source: path
zh_cn: 路径

# BasicSettingPage_AddFolderDialog_AddFolderPathBox_Header.Text
source: Folder Path
zh_cn: 文件夹路径

# BasicSettingPage_AddFolderDialog_AddJavaNameBox.PlaceholderText
source: name
zh_cn: 名称

# BasicSettingPage_AddFolderDialog_AddJavaNameBox_Header.Text
source: Name
zh_cn: 名称

# BasicSettingPage_AddFolderDialog_AddJavaPathBox.PlaceholderText
source: executable file path
zh_cn: 可执行文件路径

# BasicSettingPage_AddFolderDialog_AddJavaPathBox_Header.Text
source: Executable File Path
zh_cn: 可执行文件路径

# BasicSettingPage_AddFolderDialog_Title.Text
source: Add .minecraft Folder
zh_cn: 添加 .minecraft 目录

# BasicSettingPage_AddJavaDialog_InstallJavaButton_Content.Text
source: Install JavaRuntime
zh_cn: 安装 Java 运行时

# BasicSettingPage_AddJavaDialog_SearchJavaButton_Content.Text
source: Search JavaRuntime
zh_cn: 搜索 Java 运行时

# BasicSettingPage_AddJavaDialog_Title.Text
source: Add Java Runtime Environment
zh_cn: 添加 Java 运行时

# BasicSettingPage_FoldersListViewItem_SubTitle.Text
source: Click To Choose
zh_cn: 点击以选择

# BasicSettingPage_FoldersListViewItem_Title.Text
source: Add New .minecraft Folder
zh_cn: 添加 .minecraft 目录

# BasicSettingPage_JavasListViewItem_SubTitle.Text
source: Click To Choose
zh_cn: 点击以选择

# BasicSettingPage_JavasListViewItem_Title.Text
source: Add New Java Executable file
zh_cn: 添加 Java 运行时

# BasicSettingPage_LanguageComboBox.PlaceholderText
source: Languages
zh_cn: 语言

# BasicSettingPage_LanguageComboBox_Header.Text
source: Languages
zh_cn: 语言

# BasicSettingPage_MaxMemoryBox.Header
source: MaxMemory:
zh_cn: 最大运行内存:

# BasicSettingPage_MinMemoryBox.Header
source: MinMemory:
zh_cn: 最小运行内存:

# BasicSettingPage_ModeComboBox.PlaceholderText
source: Mode
zh_cn: 模式

# BasicSettingPage_ModeComboBox_Header.Text
source: Mode:
zh_cn: 模式

# BasicSettingPage_SubTitle1.Text
source: .minecraft Folder
zh_cn: .minecraft 目录

# BasicSettingPage_SubTitle2.Text
source: Java Runtime Environment
zh_cn: Java 运行时

# BasicSettingPage_SubTitle3.Text
source: Java Runtime Memory
zh_cn: Java 运行内存

# BasicSettingPage_SubTitle4.Text
source: Working Folder
zh_cn: 游戏运行目录

# BasicSettingPage_SubTitle5.Text
source: Language Setting
zh_cn: 语言设置

# BasicSettingPage_Title.Text
source: Basic Settings
zh_cn: 基础设置

# BasicSettingsPage_InstallJavaDialog_Info.Text
source: Please Wait.. This may take some time
zh_cn: 请稍后.. 这可能需要花费一些时间

# BasicSettingsPage_InstallJavaDialog_InstallProgressTitle.FontWeight
source: SemiBold
zh_cn: Normal

# BasicSettingsPage_InstallJavaDialog_Title.Text
source: Install Java Runtime
zh_cn: 安装 Java 运行时

# ConsolePage_InfoGrid_CoreBox.PlaceholderText
source: Core
zh_cn: 游戏核心

# ConsolePage_InfoGrid_CoreBox_Header.Text
source: Core
zh_cn: 游戏核心

# ConsolePage_InfoGrid_ProcessBox.PlaceholderText
source: Process
zh_cn: 进程

# ConsolePage_InfoGrid_ProcessBox_Header.Text
source: Process
zh_cn: 进程

# ConsolePage_TipBorder_SubTitle.Content
source: Go back to the home page and start
zh_cn: 返回主页启动游戏

# ConsolePage_TipBorder_Title.Text
source: There are no running processes
zh_cn: 没有运行中的游戏

# ContentDialog_Add.Text
source: Add
zh_cn: 添加

# ContentDialog_Cancel.Text
source: Cancel
zh_cn: 取消

# ContentDialog_Got.Text
source: Got it
zh_cn: 了解

# ContentDialog_Install.Text
source: Install
zh_cn: 安装

# ContentDialog_Rename.Text
source: Rename
zh_cn: 重命名

# CoresPage_CheckBoxs_Header.Text
source: Versions
zh_cn: 版本

# CoresPage_ComboboxTemplate_UpdateBlock.Text
source: Update:
zh_cn: 更新:

# CoresPage_InstallContentDialog_InfoPanel_Content.Text
source: The selected core will be installed in the .minecraft folder.
zh_cn: 游戏核心将会被安装在选中的 .minecraft 目录中

# CoresPage_InstallContentDialog_InfoPanel_Title.Text
source: Info
zh_cn: 提示

# CoresPage_InstallContentDialog_InstallProgressPanel_Start.FontWeight
source: SemiBold
zh_cn: Normal

# CoresPage_InstallContentDialog_InstallProgressPanel_Start.Text
source: Installing Minecraft
zh_cn: 正在安装游戏

# CoresPage_InstallContentDialog_Loading.Text
source: Please Wait
zh_cn: 请稍后

# CoresPage_InstallContentDialog_ModLoaderComboBox.PlaceholderText
source: Select Mod Loader
zh_cn: 选择加载器

# CoresPage_InstallContentDialog_ModLoaderComboBox_Header.Text
source: Mod Loader
zh_cn: 加载器

# CoresPage_InstallContentDialog_Title.Text
source: Install New Minecraft Core
zh_cn: 安装新的游戏核心

# CoresPage_InstallContentDialog_ToggleSwitch_OffContent.FontWeight
source: SemiBold
zh_cn: Normal

# CoresPage_InstallContentDialog_ToggleSwitch_OffContent.Text
source: Enabled Mod Loader Installer
zh_cn: 启用加载器

# CoresPage_InstallContentDialog_ToggleSwitch_OnContent.FontWeight
source: SemiBold
zh_cn: Normal

# CoresPage_InstallContentDialog_ToggleSwitch_OnContent.Text
source: Disabled Mod Loader Installer
zh_cn: 禁用加载器

# CoresPage_InstallContentDialog_VersionComboBox.PlaceholderText
source: Select Minecraft Core
zh_cn: 选择游戏核心

# CoresPage_InstallContentDialog_VersionComboBox_Header.Text
source: Minecraft Core
zh_cn: 游戏核心

# CoresPage_RenameContentDialog_RenameAutoSuggestBox.PlaceholderText
source: core name
zh_cn: 名称

# CoresPage_RenameContentDialog_RenameAutoSuggestBox_Header.Text
source: Core Name
zh_cn: 核心名称

# CoresPage_RenameContentDialog_Title.Text
source: Rename Minecraft Core
zh_cn: 重命名游戏核心

# CoresPage_SearchBox.PlaceholderText
source: Search...
zh_cn: 搜索...

# CoresPage_SearchBox_Header.Text
source: Search
zh_cn: 搜索

# CoresPage_ShowDialogButton_Title.Text
source: New..
zh_cn: 添加..

# CoresPage_SortBox_Header.Text
source: Sort By
zh_cn: 排序

# CoresPage_TipBorder_SubTitle.Content
source: Go back to the settings page
zh_cn: 转到设置页面

# CoresPage_TipBorder_Title.Text
source: There are no selected .minecraft Folder
zh_cn: 没有选中的 .minecraft 目录

# CoresPage_VersionDataTemplate_MenuFlyoutItem1.Text
source: Launch this version
zh_cn: 运行该版本

# CoresPage_VersionDataTemplate_MenuFlyoutItem2.Text
source: Make a launch script
zh_cn: 生成启动脚本

# CoresPage_VersionDataTemplate_MenuFlyoutItem3.Text
source: Open .minecraft Folder
zh_cn: 打开 .minecraft 目录

# CoresPage_VersionDataTemplate_MenuFlyoutItem4.Text
source: Rename this version
zh_cn: 重命名

# CoresPage_VersionDataTemplate_MenuFlyoutItem5.Text
source: Delete this version
zh_cn: 删除该版本

# CoresPage_VersionDataTemplate_PlayButton.Text
source: Play
zh_cn: 启动

# DownloadPage_1_Annotate1.Text
source: The game will be downloaded using the selected download source
zh_cn: 安装游戏时，游戏将从你选择源中下载

# DownloadPage_2_Annotate1.Text
source: The maximum number of threads may not effectively increase the download speed
zh_cn: 最大下载线程数会影响下载速度和网络占用

# DownloadPage_2_Annotate2.Text
source: It should depend on your bandwidth
zh_cn: 这应该取决于你的实际情况

# DownloadPage_ContentComboBox.PlaceholderText
source: source
zh_cn: 源

# DownloadPage_ContentComboBox_Header.Text
source: Source:
zh_cn: 可用源:

# DownloadPage_ContentDialog_OK.Text
source: Got it
zh_cn: 了解

# DownloadPage_ContentDialog_Title.Text
source: Dependencies
zh_cn: 依赖

# DownloadPage_NumberBox.Header
source: Max Threads:
zh_cn: 最大线程数:

# DownloadPage_NumberBox.PlaceholderText
source: Int
zh_cn: 数

# DownloadPage_SubTitle1.Text
source: Download Source
zh_cn: 下载源设置

# DownloadPage_SubTitle2.Text
source: Max Number of Threads
zh_cn: 下载最大线程数

# DownloadPage_ThreadsSlider.Header
source: Value:
zh_cn: 值:

# DownloadPage_Title.Text
source: Download Settings
zh_cn: 下载设置

# MainContainer_NavigationViewItem1.Content
source: Home
zh_cn: 主页

# MainContainer_NavigationViewItem2.Content
source: News
zh_cn: 新闻

# MainContainer_NavigationViewItem3.Content
source: Cores
zh_cn: 游戏核心

# MainContainer_NavigationViewItem4.Content
source: Console
zh_cn: 控制台

# MainContainer_NavigationViewItem5.Content
source: Help
zh_cn: 帮助

# MainContainer_NavigationViewItem6.Content
source: Settings
zh_cn: 设置

# MainPge_LaunchDialog_DownloadProgressText.FontWeight
source: SemiBold
zh_cn: Normal

# MainPge_LaunchDialog_LaunchingProgressText.FontWeight
source: SemiBold
zh_cn: Normal

# NewsPage_CheckBoxs_Header.Text
source: Sort
zh_cn: 分类

# NewsPage_NewsDataTemplate_Button_Content.FontWeight
source: SemiBold
zh_cn: Normal

# NewsPage_NewsDataTemplate_Button_Content.Text
source: Read the manuscript
zh_cn: 阅读稿件

# NewsPage_SearchBox.PlaceholderText
source: News Title
zh_cn: 新闻标题

# NewsPage_SearchBox_Header.Text
source: Search
zh_cn: 搜索

# SettingPage_NavigationView.PaneTitle
source: Settings
zh_cn: 设置

# SettingPage_NavigationViewItem1.Content
source: Basic Settings
zh_cn: 基础设置

# SettingPage_NavigationViewItem2.Content
source: Account
zh_cn: 账户

# SettingPage_NavigationViewItem3.Content
source: Download
zh_cn: 下载

# SettingPage_NavigationViewItem4.Content
source: Process
zh_cn: 控制台

# SettingPage_NavigationViewItem5.Content
source: Theme
zh_cn: 主题

# SettingPage_NavigationViewItem6.Content
source: About
zh_cn: 关于

# UpdateLogTextBlock.Text
source: Preview Edition - 1.0.28 Added support for external login Added support for dragging and dropping urls for external logins Added theme function [New theme is not supported at the moment, the next version will open] Added the ability to switch launcher themes in real time Added support for pictures and videos as backgrounds Added support for theme colors [requires launcher to run] Added project open source address [in AboutPage] Added Chinese translation for account types Fixed a crash caused by a unit conversion error when installing the Java Runtime Fixed a lot of detail issues Preview Edition - 1.0.27 Added the ability to run the game core in isolation Added Chinese translation of the protocol interface Added setting options for a separate core [currently only the UI part is completed and cannot be used] Fixed the problem that the protocol interface could not be checked Fixed a bug where the same Java Runtime was added repeatedly on first launch Fixed many detail issues Removed launcher theme color Preview Edition - 1.0.26 Added hint bubbles that are displayed when the conditions to start the game are insufficient Added hint in CoresPage when .minecraft directory is not selected Added the ability for the launcher language to automatically follow the system on first boot Added the function of real-time progress synchronization of the installation version progress bar Fixed a bug where the path in the Add .minecraft directory / Java runtime dialog can be added if the path is arbitrarily entered Fixed a bug where launching the game again after launching the game would cause the desktop bridge to crash Fixed bug where MinecraftCores didn't update when deleting a directory Fixed a bug where new versions could be installed without a .minecraft directory Fixed some spelling mistakes in English translations Fixed bug when installing vanilla game without Java runtime Removed window resizing on every startup now only resizes on first startup Release Edition - 1.0.25.0 Support Optifine install Added automatically discovery,installation and selection Java Runtime (If the Luancher uninstall,Java Runtime will uninstall together) Added automatically scrolling to the currently selected game core in corespage Added the display of the currently started game process information in the console page Added the Chinese of startup status at the startup game Added named game core Added generating startup script Fixed the error that the game can be started when the Jvav runtime is null Fixed the display error of current Java information when the Java runtime is empty under basicsettingspage Fixed the display error when the Java runtime path is too long in basicsettingspage Fixed the display error of information prompt box Fixed the loading background color error of the game installation dialog box in dark mode Fixed a title text error in the game installation dialog Preview Edition - 1.0.24.0 Added multilingual support Added game installer, Now the launcher supports original versions and Forge-added versions' installation. Added display of update log. Added uninstall version Modified the popup dialog box when the game crashes to be a message box at the bottom of the page. Fixed a bug in the Console Page where the acrylic background colour is layered. Fixed a saving error in the Download Settings Page. Fixed the error of repeated loading of minecraft news Fixed the bug which caused downloads impossible using the official source. Fixed many other issues in FluentCore. Preview Edition - 1.0.23.0 Major refactoring of launcher's code. Modified settings saving way Modified the Microsoft account login method (Adopt built-in browser by webview2) Modified the way of loading news, now we use multi-threaded asynchronous loading to do it. Modified the UI of the dialog box. Fixed many bugs which caused by MVVM. Added Microsoft account refresh in the account settings page instead of automatically refreshing the Microsoft account authentication token when the Launcher is opening
zh_cn: 预览版 - 1.0.28 添加了对外置登录的支持 添加了外置登录拖拽 url 的支持 添加了主题功能 [暂不支持新建主题 下个版本开放] 添加了实时切换启动器主题的功能 添加了对图片、视频作为背景的支持 添加了对主题色的支持 [需要运行启动器] 添加了项目开源地址 [在 AboutPage 中] 添加了账户类型的中文对照 修复了安装 Java运行时 单位转换时错误导致的崩溃 修复了大量细节问题 预览版 - 1.0.27 添加了游戏核心隔离运行的功能 添加了协议界面的中文翻译 添加了单独核心的设置选项 [目前只完成了UI部分 不能使用] 修复了协议界面无法勾选的问题 修复了第一次启动时重复添加相同 Java Runtime 的错误 修复了许多细节问题 删除了启动器主题色 预览版 - 1.0.26 添加了提示气泡 当启动游戏条件不足时会显示 添加了CoresPage中当 .minecraft 目录未选中时的提示 添加了第一次启动时启动器语言自动跟随系统的功能 添加了安装版本进度条实时进度同步的功能 修复了添加 .minecraft目录 / Java 运行时对话框中路径随意输入却可以添加的错误 修复了启动游戏后再次启动游戏导致桌面桥崩溃的错误 修复了删除目录时 MinecraftCores 没有更新的错误 修复了无 .minecraft 目录时依然可以安装新版本的错误 修复了部分英文翻译单词拼写错误 修复了无 Java 运行时安装原版游戏时的错误 删除了每次启动时都会调整窗口大小的操作 现在只会在第一次启动时调整 正式版 - 1.0.25.0 添加了游戏安装器对自动安装OptiFine的支持 添加了启动游戏时自动选择合适版本的 Java 运行时的功能 添加了查找计算机上现有的 Java 运行时的功能 添加了自动安装 Java 运行时 的功能 当你删除启动器时，自动安装的 Java 运行时会一并删除 添加了CoresPage中自动滚动到当前选定游戏核心的功能 添加了ConsolePage中当前启动游戏进程信息的显示 添加了启动游戏对话框中启动状态的中文 添加了第一次打开启动器自动搜索 Java 运行时的功能 添加了重名游戏核心的功能 添加了生成启动脚本的功能 修复了当 Java 运行时为空的时，还能进行启动游戏操作的错误 修复了BasicSettingsPage下，当 Java 运行时为空时，当前Java信息的显示错误 修复了BasicSettingsPage下，Java 运行时路径路径过长时的显示错误 修复了信息提示框的显示错误 修复了深色模式下游戏安装对话框的加载背景颜色错误 修复了游戏安装对话框的标题文字错误 预览版 - 1.0.24.0 添加了游戏安装器 目前支持原版和Forge的安装 添加了更新日志显示 添加了Cores Page中删除版本的功能 修改了游戏崩溃时弹出的对话框为页面底部的信息框 修复了Console Page中亚克力背景颜色分层的错误 修复了Download Settings Page中的保存错误 修复了主页新闻重复加载的错误 修复了使用官方源无法下载的错误 修复了FluentCore中的诸多问题 预览版 - 1.0.23.0 启动器代码大规模重构 修改了设置页面中设置的保存方式 修改了Microsoft账户登录方式 采用应用内浏览器 修改了新闻加载方式 采用了多线程异步加载 修改了对话框的UI 修复了诸多MVVM带来的错误 删除了启动器打开时自动刷新Microsoft账户验证令牌 添加了Account Settings Page中Microsoft账户刷新
